Revit 2027 API
ExportResolution Enumeration
 An enumerated type listing possible options to control the tessellation quality.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ExportResolution
Public Enumeration ExportResolution
public enum class ExportResolution
type ExportResolution
Members
Member name | Value | Description
Coarse | 3 |  Tessellated export with coarse resolution.
Custom | 0 |  Tessellated export with custom resolution (all tessellation parameters have default values).
Fine | 1 |  Tessellated export with fine resolution.
Medium | 2 |  Tessellated export with medium resolution.
See Also
Reference
Autodesk.Revit.DB Namespace